ProgessBase/Documents/ПЦ_УстановкаУсловийДополнительногоИзмененияЦены.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Document>
		<Properties>
			<Name>ПЦ_УстановкаУсловийДополнительногоИзмененияЦены</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.ПЦ_ИсключенияУсловииДополнительногоИзмененияЦены</xr:Item>
				<xr:Item>InformationRegister.ПЦ_УсловияДополнительногоИзмененияЦены</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ПериодДействияС</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодДействияПо</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаВходящегоДокумента</Name>
					<Comment>(Общ) </Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерВходящегоДокумента</Name>
					<Comment>(Общ) </Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатусДокумента</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПЦ_СтатусыУстановкиДопУсловийИзмененияЦен</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Условия</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>АдресПоставки</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.АдресаПоставки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПроектГП</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПРГ_ПроектыГП</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТоварнаяКатегория</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.НСИ_ТоварныеКатегории</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Брендообъем</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.НСИ_Брендообъемы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Условие</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПЦ_УсловияДополнительногоИзмененияЦены</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПроцентИзмененияЦены</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Комментарий</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Исключения</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>АдресПоставки</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.АдресаПоставки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПроектГП</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПРГ_ПроектыГП</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТоварнаяКатегория</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.НСИ_ТоварныеКатегории</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Брендообъем</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.НСИ_Брендообъемы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Условие</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПЦ_УсловияДополнительногоИзмененияЦены</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

ProgessBase/InformationRegisters/ПЦ_ИсключенияУсловииДополнительногоИзмененияЦены.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>ПЦ_ИсключенияУсловииДополнительногоИзмененияЦены</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>АдресПоставки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.АдресаПоставки</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПроектГП</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПРГ_ПроектыГП</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТоварнаяКатегория</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НСИ_ТоварныеКатегории</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Брендообъем</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НСИ_Брендообъемы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПериодДействияС</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПериодДействияПо</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Условие</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПЦ_УсловияДополнительногоИзмененияЦены</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

ProgessBase/InformationRegisters/ПЦ_УсловияДополнительногоИзмененияЦены.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>ПЦ_УсловияДополнительногоИзмененияЦены</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ПроцентИзмененияЦены</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>АдресПоставки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.АдресаПоставки</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПроектГП</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПРГ_ПроектыГП</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТоварнаяКатегория</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НСИ_ТоварныеКатегории</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Брендообъем</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НСИ_Брендообъемы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПериодДействияС</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПериодДействияПо</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Условие</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПЦ_УсловияДополнительногоИзмененияЦены</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

ProgessBase/InformationRegisters/АП_СтатусыДокументов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>АП_СтатусыДокументов</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПТЛ_СтатусыПланаДоставки</v8:Type>
						<v8:Type>cfg:EnumRef.ПТЛ_СтатусыЗаданияНаПеревозку</v8:Type>
						<v8:Type>cfg:EnumRef.СП_СтатусыТребованияНакладной</v8:Type>
						<v8:Type>cfg:EnumRef.ПЦ_СтатусыУстановкиДопУсловийИзмененияЦен</v8:Type>
						<v8:Type>cfg:EnumRef.ПЦ_СтатусыЦеновыеЭшелоны</v8:Type>
						<v8:Type>cfg:EnumRef.ПР_СтатусыПретензии</v8:Type>
						<v8:Type>cfg:EnumRef.СП_СтатусыПеремещенияТоваров</v8:Type>
						<v8:Type>cfg:EnumRef.СП_СтатусыКомплектацииНоменклатуры</v8:Type>
						<v8:Type>cfg:EnumRef.СП_СтатусыВозвратТоваровПоставщику</v8:Type>
						<v8:Type>cfg:EnumRef.СП_СтатусыПоступленияТоваров</v8:Type>
						<v8:Type>cfg:EnumRef.СП_СтатусыПриходногоОрдераСолво</v8:Type>
						<v8:Type>cfg:EnumRef.СП_СтатусыЗаданияНаСмену</v8:Type>
						<v8:Type>cfg:EnumRef.УЗ_СтатусыЗаказовПоставщикам</v8:Type>
						<v8:Type>cfg:EnumRef.СП_СтатусыЗаданияНаПодбор</v8:Type>
						<v8:Type>cfg:EnumRef.КП_СтатусыИмпортированногоЗаказа</v8:Type>
						<v8:Type>cfg:EnumRef.АП_СтатусыЗаказов</v8:Type>
						<v8:Type>cfg:EnumRef.ПКК_СтатусВедомостиПоРасчетуБонусовУслуг</v8:Type>
						<v8:Type>cfg:EnumRef.ПКК_СтатусГрафикаБонусов</v8:Type>
						<v8:Type>cfg:EnumRef.ПРГ_СтатусыДокументаУсловияПоставки</v8:Type>
						<v8:Type>cfg:EnumRef.ПЦ_СтатусыУстановкиСкидокНоменклатуры</v8:Type>
						<v8:Type>cfg:EnumRef.ПЦ_СтатусыУстановкиЦенНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Документ</Name>
					<Type>
						<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

ProgessBase/Enums/ПЦ_СтатусыУстановкиДопУсловийИзмененияЦен.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Enum>
		<Properties>
			<Name>ПЦ_СтатусыУстановкиДопУсловийИзмененияЦен</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Новый</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Подготовлен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Согласовано</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отклонено</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

ProgessBase/Documents/ПЦ_УстановкаУсловийДополнительногоИзмененияЦены/Ext/ObjectModule.bsl
Перем мУдалятьДвижения Экспорт;

#Если Клиент Тогда

// Процедура осуществляет печать документа. Можно направить печать на 
// экран или принтер, а также распечатать необходимое количество копий.
//
//  Название макета печати передается в качестве параметра,
// по переданному названию находим имя макета в соответствии.
//
// Параметры:
//  НазваниеМакета - строка, название макета.
//
Процедура Печать(ИмяМакета, КоличествоЭкземпляров = 1, НаПринтер = Ложь) Экспорт
	
	Если ЭтоНовый() Тогда
		Предупреждение(НСтр("ru = 'Документ можно распечатать только после его записи'"));
		Возврат;
	ИначеЕсли Не УправлениеДопПравамиПользователей.РазрешитьПечатьНепроведенныхДокументов(Проведен) Тогда
		Предупреждение(НСтр("ru = Недостаточно полномочий для печати непроведенного документа!'"));
		Возврат;
	КонецЕсли;
	
	Если Не РаботаСДиалогами.ПроверитьМодифицированность(ЭтотОбъект) Тогда
		Возврат;
	КонецЕсли;
	
	// Получить экземпляр документа на печать
	Если ИмяМакета = "Приказ" Тогда
		//ТабДокумент = ПечатьПриказа(); //breakpoint Островерхий, 15.11.2016 11:40:51  
	ИначеЕсли ТипЗнч(ИмяМакета) = Тип("ДвоичныеДанные") Тогда
		
		ТабДокумент = УниверсальныеМеханизмы.НапечататьВнешнююФорму(Ссылка, ИмяМакета);
		
		Если ТабДокумент = Неопределено Тогда
			Возврат
		КонецЕсли; 
	КонецЕсли;
	
	УниверсальныеМеханизмы.НапечататьДокумент(ТабДокумент, КоличествоЭкземпляров, НаПринтер, ОбщегоНазначения.СформироватьЗаголовокДокумента(ЭтотОбъект), Ссылка);
	
КонецПроцедуры // Печать

// Возвращает доступные варианты печати документа
//
// Возвращаемое значение:
//  Структура, каждая строка которой соответствует одному из вариантов печати
//  
Функция ПолучитьСтруктуруПечатныхФорм() Экспорт
	
	СтруктПечатныхФорм = Новый Структура;
	
	Возврат СтруктПечатныхФорм;
	
КонецФункции // ПолучитьСтруктуруПечатныхФорм()

#КонецЕсли

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка  Тогда
		Возврат;
	КонецЕсли;
	
	мУдалятьДвижения = НЕ ЭтоНовый();
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка  Тогда
		Возврат;
	КонецЕсли;
	
	//{22.12.2016 Островерхий заявка №60480 
	Если Не Отказ Тогда
		ЗаписатьИзменениеСтатусов(Отказ);
	КонецЕсли; 
	//22.12.2016 Островерхий} 
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)

	Если мУдалятьДвижения Тогда
		ОбщегоНазначения.УдалитьДвиженияРегистратора(ЭтотОбъект, Отказ);
	КонецЕсли;
	
	// Сформируем структуру реквизитов шапки документа
	СтруктураШапкиДокумента = ОбщегоНазначения.СформироватьСтруктуруШапкиДокумента(ЭтотОбъект);
	
	Заголовок = ОбщегоНазначения.ПредставлениеДокументаПриПроведении(Ссылка);
	
	ПроверкаРеквизитов(Отказ, Заголовок, СтруктураШапкиДокумента);
	
	ПроверитьЗаполнениеТабличнойЧасти("Условия", СтруктураШапкиДокумента, Отказ, Заголовок);
	ПроверитьЗаполнениеТабличнойЧасти("Исключения", СтруктураШапкиДокумента, Отказ, Заголовок);
	
	СтруктураТаблицДвижений = ПолучитьСтруктуруТаблицДвиженийРегистров(СтруктураШапкиДокумента);
	
	// Добавим дополнительные поля в структуру шапки документа.
	ПодготовитьСтруктуруШапкиДокумента(
		СтруктураШапкиДокумента,
		Отказ, 
		Заголовок
		);
		
	СформироватьТаблицыДвижений(СтруктураШапкиДокумента,СтруктураТаблицДвижений);	
	
	// Движения по документу
	Если Не Отказ 
		//{22.12.2016 Островерхий заявка №60480 
		И СтатусДокумента = Перечисления.ПЦ_СтатусыУстановкиДопУсловийИзмененияЦен.Согласовано Тогда
		//22.12.2016 Островерхий} 
		ДвиженияПоРегистрам(РежимПроведения, СтруктураШапкиДокумента, СтруктураТаблицДвижений, Отказ, Заголовок);
	КонецЕсли;

КонецПроцедуры

Процедура ПроверитьЗаполнениеТабличнойЧасти(ИмяТабличнойЧасти, СтруктураШапкиДокумента, Отказ, Заголовок)

	СтруктураОбязательныхПолей = Новый Структура();
	СтруктураОбязательныхПолей.Вставить("Условие");	
	
	Если ИмяТабличнойЧасти = "Условия" Тогда
	
	    СтруктураОбязательныхПолей.Вставить("ПроцентИзмененияЦены");
		
	КонецЕсли; 

	ЗаполнениеДокументов.ПроверитьЗаполнениеТабличнойЧасти(ЭтотОбъект, ИмяТабличнойЧасти, СтруктураОбязательныхПолей, Отказ, Заголовок);
 	
КонецПроцедуры // ПроверитьЗаполнениеТабличнойЧастиТовары()

// Функция формирует структуру таблиц движений регистров.
//
// Параметры
//  СтруктураШапкиДокумента – Структура - Реквизиты документа "Расчет себестоимости"
//
// Возвращаемое значение:
//   Структура – Структура таблиц движений регистров
//
Функция ПолучитьСтруктуруТаблицДвиженийРегистров(
	СтруктураШапкиДокумента
	)
	
	ПЦ_ИсключенияУсловииДополнительногоИзмененияЦены = Движения.ПЦ_ИсключенияУсловииДополнительногоИзмененияЦены;
	ПЦ_УсловияДополнительногоИзмененияЦены	  		 = Движения.ПЦ_УсловияДополнительногоИзмененияЦены;
	
	//мТаблицаДвиженийИсключений = ПЦ_ИсключенияУсловииДополнительногоИзмененияЦены.Выгрузить();
	//мТаблицаДвиженийУсловий 	 = ПЦ_УсловияДополнительногоИзмененияЦены.Выгрузить();
	
	СтруктураТаблицДвижений = Новый Структура;
	СтруктураТаблицДвижений.Вставить("ТаблицаДвиженийИсключений", ПЦ_ИсключенияУсловииДополнительногоИзмененияЦены.Выгрузить());
	СтруктураТаблицДвижений.Вставить("ТаблицаДвиженийУсловий",    ПЦ_УсловияДополнительногоИзмененияЦены.Выгрузить());
	
	Возврат СтруктураТаблицДвижений;
	
КонецФункции // ПолучитьСтруктуруТаблицДвиженийРегистров()

Процедура ДвиженияПоРегистрам(РежимПроведения, СтруктураШапкиДокумента, СтруктураТаблицДвижений, Отказ, Заголовок)

	ПЦ_УсловияДополнительногоИзмененияЦены(РежимПроведения, СтруктураШапкиДокумента, СтруктураТаблицДвижений, Отказ);	
    ПЦ_ИсключенияУсловииДополнительногоИзмененияЦены(РежимПроведения, СтруктураШапкиДокумента, СтруктураТаблицДвижений, Отказ);
	
КонецПроцедуры

Процедура ПЦ_УсловияДополнительногоИзмененияЦены(РежимПроведения, СтруктураШапкиДокумента, СтруктураТаблицДвижений, Отказ)

	Если СтруктураТаблицДвижений.ТаблицаДвиженийУсловий.Количество()=0 Тогда 
		Возврат;
	КонецЕсли;
	
	Если Не Отказ Тогда
		
		// регистр ПЦ_УсловияДополнительногоИзмененияЦены
		Движения.ПЦ_УсловияДополнительногоИзмененияЦены.Записывать = Истина;
		Движения.ПЦ_УсловияДополнительногоИзмененияЦены.Очистить();
		
		Для Каждого ТекСтрокаУсловия Из СтруктураТаблицДвижений.ТаблицаДвиженийУсловий Цикл
			Движение = Движения.ПЦ_УсловияДополнительногоИзмененияЦены.Добавить();
			ЗаполнитьЗначенияСвойств(Движение,ТекСтрокаУсловия);
		КонецЦикла;
		
	КонецЕсли;	

КонецПроцедуры

Процедура ПЦ_ИсключенияУсловииДополнительногоИзмененияЦены(РежимПроведения, СтруктураШапкиДокумента, СтруктураТаблицДвижений, Отказ)

	Если СтруктураТаблицДвижений.ТаблицаДвиженийИсключений.Количество()=0 Тогда 
		Возврат;
	КонецЕсли;
	
	Если Не Отказ Тогда
		
		// регистр ПЦ_ИсключенияУсловииДополнительногоИзмененияЦены
		Движения.ПЦ_ИсключенияУсловииДополнительногоИзмененияЦены.Записывать = Истина;
		Движения.ПЦ_ИсключенияУсловииДополнительногоИзмененияЦены.Очистить();
		
		Для Каждого ТекСтрокаИсключений Из СтруктураТаблицДвижений.ТаблицаДвиженийИсключений Цикл
			Движение = Движения.ПЦ_ИсключенияУсловииДополнительногоИзмененияЦены.Добавить();
			ЗаполнитьЗначенияСвойств(Движение,ТекСтрокаИсключений);
		КонецЦикла;
		
	КонецЕсли;		

КонецПроцедуры
 
Процедура ПроверкаРеквизитов(Отказ, Заголовок, СтруктураШапкиДокумента) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВложенныйЗапрос.Контрагент,
		|	ВложенныйЗапрос.АдресПоставки,
		|	ВложенныйЗапрос.ПроектГП,
		|	ВложенныйЗапрос.ТоварнаяКатегория,
		|	ВложенныйЗапрос.Брендообъем,
		|	ВложенныйЗапрос.ПериодДействияС,
		|	ВложенныйЗапрос.ПериодДействияПо,
		|	ВложенныйЗапрос.Условие,
		|	ВложенныйЗапрос.Ссылка
		|ПОМЕСТИТЬ вт
		|ИЗ
		|	(ВЫБРАТЬ
		|		ПЦ_УстановкаУсловийДополнительногоИзмененияЦеныУсловия.Ссылка КАК Ссылка,
		|		ПЦ_УстановкаУсловийДополнительногоИзмененияЦеныУсловия.АдресПоставки КАК АдресПоставки,
		|		ПЦ_УстановкаУсловийДополнительногоИзмененияЦеныУсловия.ПроектГП КАК ПроектГП,
		|		ПЦ_УстановкаУсловийДополнительногоИзмененияЦеныУсловия.ТоварнаяКатегория КАК ТоварнаяКатегория,
		|		ПЦ_УстановкаУсловийДополнительногоИзмененияЦеныУсловия.Брендообъем КАК Брендообъем,
		|		ПЦ_УстановкаУсловийДополнительногоИзмененияЦеныУсловия.Условие КАК Условие,
		|		ПЦ_УстановкаУсловийДополнительногоИзмененияЦеныУсловия.ПроцентИзмененияЦены КАК ПроцентИзмененияЦены,
		|		ПЦ_УстановкаУсловийДополнительногоИзмененияЦеныУсловия.Комментарий КАК Комментарий,
		|		ПЦ_УстановкаУсловийДополнительногоИзмененияЦеныУсловия.Ссылка.Контрагент КАК Контрагент,
		|		ПЦ_УстановкаУсловийДополнительногоИзмененияЦеныУсловия.Ссылка.ПериодДействияС КАК ПериодДействияС,
		|		ПЦ_УстановкаУсловийДополнительногоИзмененияЦеныУсловия.Ссылка.ПериодДействияПо КАК ПериодДействияПо
		|	ИЗ
		|		Документ.ПЦ_УстановкаУсловийДополнительногоИзмененияЦены.Условия КАК ПЦ_УстановкаУсловийДополнительногоИзмененияЦеныУсловия
		|	ГДЕ
		|		ПЦ_УстановкаУсловийДополнительногоИзмененияЦеныУсловия.Ссылка = &Ссылка) КАК ВложенныйЗапрос
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ПЦ_УсловияДополнительногоИзмененияЦены.Регистратор,
		|	ПЦ_УсловияДополнительногоИзмененияЦены.НомерСтроки,
		|	ПЦ_УсловияДополнительногоИзмененияЦены.Контрагент,
		|	ПЦ_УсловияДополнительногоИзмененияЦены.АдресПоставки,
		|	ПЦ_УсловияДополнительногоИзмененияЦены.ПроектГП,
		|	ПЦ_УсловияДополнительногоИзмененияЦены.ТоварнаяКатегория,
		|	ПЦ_УсловияДополнительногоИзмененияЦены.Брендообъем,
		|	ПЦ_УсловияДополнительногоИзмененияЦены.ПериодДействияС,
		|	ПЦ_УсловияДополнительногоИзмененияЦены.ПериодДействияПо,
		|	ПЦ_УсловияДополнительногоИзмененияЦены.Условие
		|ИЗ
		|	вт КАК вт
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ПЦ_УсловияДополнительногоИзмененияЦены КАК ПЦ_УсловияДополнительногоИзмененияЦены
		|		ПО вт.Контрагент = ПЦ_УсловияДополнительногоИзмененияЦены.Контрагент
		|			И вт.АдресПоставки = ПЦ_УсловияДополнительногоИзмененияЦены.АдресПоставки
		|			И вт.ПроектГП = ПЦ_УсловияДополнительногоИзмененияЦены.ПроектГП
		|			И вт.ТоварнаяКатегория = ПЦ_УсловияДополнительногоИзмененияЦены.ТоварнаяКатегория
		|			И вт.Брендообъем = ПЦ_УсловияДополнительногоИзмененияЦены.Брендообъем
		|			И вт.Условие = ПЦ_УсловияДополнительногоИзмененияЦены.Условие
		|			И (НЕ ПЦ_УсловияДополнительногоИзмененияЦены.Регистратор = &Ссылка)
		|			И (вт.ПериодДействияС МЕЖДУ ПЦ_УсловияДополнительногоИзмененияЦены.ПериодДействияС И ПЦ_УсловияДополнительногоИзмененияЦены.ПериодДействияПо
		|				ИЛИ вт.ПериодДействияПо МЕЖДУ ПЦ_УсловияДополнительногоИзмененияЦены.ПериодДействияС И ПЦ_УсловияДополнительногоИзмененияЦены.ПериодДействияПо
		|				ИЛИ вт.ПериодДействияС < ПЦ_УсловияДополнительногоИзмененияЦены.ПериодДействияПо
		|					И вт.ПериодДействияПо > ПЦ_УсловияДополнительногоИзмененияЦены.ПериодДействияС)";

	Запрос.УстановитьПараметр("Ссылка", Ссылка);

	Результат = Запрос.Выполнить().Выгрузить();

	Если Результат.Количество() > 0 Тогда
	
		ОбщегоНазначения.СообщитьОбОшибке("Уж есть дублирующие документы установки условий дополнительного изменения цены:", Отказ, Заголовок);		
		Для каждого ТекСтрока Из Результат Цикл
			Сообщить(Строка(ТекСтрока.Регистратор)+" в строке "+Строка(ТекСтрока.НомерСтроки),СтатусСообщения.Информация);	
		КонецЦикла; 
		
	КонецЕсли; 
		
КонецПроцедуры // ПроверкаРеквизитов()

// Процедура формирует структуру шапки документа и дополнительных полей.
//
// Параметры
//  СтруктураШапкиДокумента – Структура - Реквизиты документа "Расчет себестоимости"
//	Отказ - Булево - Признак отказа от проведения документа
//	Заголовок - Строка - Текст представления документа 
//
//
Процедура ПодготовитьСтруктуруШапкиДокумента(
	СтруктураШапкиДокумента, 
	Отказ, 
	Заголовок
	)  Экспорт
	
	СтруктураШапкиДокумента.ПериодДействияПо = КонецДня(СтруктураШапкиДокумента.ПериодДействияПо);
	
КонецПроцедуры // ПодготовитьСтруктуруШапкиДокумента()

Процедура СформироватьТаблицыДвижений(СтруктураШапкиДокумента, СтруктураТаблицДвижений)

	//Условия
	Для Каждого ТекСтрока Из Условия Цикл
		тНоваяСтрока = СтруктураТаблицДвижений.ТаблицаДвиженийУсловий.Добавить();
		ЗаполнитьЗначенияСвойств(тНоваяСтрока,ТекСтрока);
	КонецЦикла;
	
	СтруктураТаблицДвижений.ТаблицаДвиженийУсловий.ЗаполнитьЗначения(СтруктураШапкиДокумента.ПериодДействияС, "ПериодДействияС"); 
	СтруктураТаблицДвижений.ТаблицаДвиженийУсловий.ЗаполнитьЗначения(СтруктураШапкиДокумента.ПериодДействияПо, "ПериодДействияПо"); 
	СтруктураТаблицДвижений.ТаблицаДвиженийУсловий.ЗаполнитьЗначения(СтруктураШапкиДокумента.Контрагент, "Контрагент"); 
	СтруктураТаблицДвижений.ТаблицаДвиженийУсловий.ЗаполнитьЗначения(Истина, "Активность");
	
	//Исключения
	Для Каждого ТекСтрока Из Исключения Цикл
		тНоваяСтрока = СтруктураТаблицДвижений.ТаблицаДвиженийИсключений.Добавить();
		ЗаполнитьЗначенияСвойств(тНоваяСтрока,ТекСтрока);
	КонецЦикла;

	СтруктураТаблицДвижений.ТаблицаДвиженийИсключений.ЗаполнитьЗначения(СтруктураШапкиДокумента.ПериодДействияС, "ПериодДействияС"); 
	СтруктураТаблицДвижений.ТаблицаДвиженийИсключений.ЗаполнитьЗначения(СтруктураШапкиДокумента.ПериодДействияПо, "ПериодДействияПо"); 
	СтруктураТаблицДвижений.ТаблицаДвиженийИсключений.ЗаполнитьЗначения(СтруктураШапкиДокумента.Контрагент, "Контрагент");
	СтруктураТаблицДвижений.ТаблицаДвиженийИсключений.ЗаполнитьЗначения(Истина, "Активность");
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	ПроверяемыеРеквизиты.Добавить("ПериодДействияС");
	ПроверяемыеРеквизиты.Добавить("ПериодДействияПо");
	ПроверяемыеРеквизиты.Добавить("Контрагент");

КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	
	Заголовок = ОбщегоНазначения.ПредставлениеДокументаПриПроведении(Ссылка);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗаказПокупателя.Ссылка
		|ИЗ
		|	Документ.ЗаказПокупателя КАК ЗаказПокупателя
		|ГДЕ
		|	ЗаказПокупателя.Проведен
		|	И ЗаказПокупателя.Дата МЕЖДУ &ПериодДействияС И &ПериодДействияПо
		|	И ЗаказПокупателя.Контрагент = &Контрагент";

	Запрос.УстановитьПараметр("Контрагент", Контрагент);
	Запрос.УстановитьПараметр("ПериодДействияПо", ПериодДействияПо);
	Запрос.УстановитьПараметр("ПериодДействияС", ПериодДействияС);

	РезультатПустой = Запрос.Выполнить().Пустой();

	Если НЕ РезультатПустой Тогда
	
		ОбщегоНазначения.СообщитьОбОшибке("Есть оформленные заказы покупателей за период действия данного документа", ?(РольДоступна("ПолныеПрава"),Ложь,Отказ), Заголовок);	
	
	КонецЕсли; 
	
КонецПроцедуры

Процедура ЗаполнитьТаблицУсловий(ТЗ) Экспорт 

	Если ТЗ.Количество() > 0 Тогда
		Условия.Очистить();
	Иначе	
		Возврат;
	КонецЕсли; 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Таблица.АдресПоставки,
		|	Таблица.ПроектГП,
		|	Таблица.ТоварнаяКатегория,
		|	Таблица.Брендообъем,
		|	Таблица.Условие,
		|	Таблица.ПроцентИзмененияЦены,
		|	Таблица.Комментарий
		|ПОМЕСТИТЬ втТаблица
		|ИЗ
		|	&Таблица КАК Таблица
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	АдресаПоставки.Ссылка КАК АдресПоставки,
		|	ПРГ_ПроектыГП.Ссылка КАК ПроектГП,
		|	НСИ_ТоварныеКатегории.Ссылка КАК ТоварнаяКатегория,
		|	НСИ_Брендообъемы.Ссылка КАК Брендообъем,
		|	ПЦ_УсловияДополнительногоИзмененияЦены.Ссылка КАК Условие,
		|	втТаблица.ПроцентИзмененияЦены,
		|	втТаблица.Комментарий
		|ИЗ
		|	втТаблица КАК втТаблица
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.НСИ_Брендообъемы КАК НСИ_Брендообъемы
		|		ПО (НЕ НСИ_Брендообъемы.ПометкаУдаления)
		|			И втТаблица.Брендообъем = НСИ_Брендообъемы.Код
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.АдресаПоставки КАК АдресаПоставки
		|		ПО втТаблица.АдресПоставки = АдресаПоставки.КодАдреса
		|			И (АдресаПоставки.Владелец = &Ссылка)
		|			И (НЕ АдресаПоставки.ПометкаУдаления)
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ПРГ_ПроектыГП КАК ПРГ_ПроектыГП
		|		ПО втТаблица.ПроектГП = ПРГ_ПроектыГП.Код
		|			И (НЕ ПРГ_ПроектыГП.ПометкаУдаления)
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.НСИ_ТоварныеКатегории КАК НСИ_ТоварныеКатегории
		|		ПО втТаблица.ТоварнаяКатегория = НСИ_ТоварныеКатегории.Код
		|			И (НЕ НСИ_ТоварныеКатегории.ПометкаУдаления)
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ПЦ_УсловияДополнительногоИзмененияЦены КАК ПЦ_УсловияДополнительногоИзмененияЦены
		|		ПО втТаблица.Условие = ПЦ_УсловияДополнительногоИзмененияЦены.Код
		|			И (НЕ ПЦ_УсловияДополнительногоИзмененияЦены.ПометкаУдаления)";

	Запрос.УстановитьПараметр("Таблица",ТЗ);
	Запрос.УстановитьПараметр("Ссылка",Контрагент);

	Результат = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = Результат.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		тНоваяСтрока = Условия.Добавить();
		ЗаполнитьЗначенияСвойств(тНоваяСтрока,ВыборкаДетальныеЗаписи);
		
	КонецЦикла; 

КонецПроцедуры
 
Процедура ЗаписатьИзменениеСтатусов(Отказ) Экспорт
	
	//Движения по регистру накопления "АП_СтатусыДокументов"
	ДанныеПоСтатусу = РегистрыСведений.АП_СтатусыДокументов.СрезПоследних(ТекущаяДата(), Новый Структура("Документ", Ссылка));
	
	Если ДанныеПоСтатусу.Количество() = 0 Тогда
		СформируемЗаписьПоРегиструСтатусы(Отказ);
	ИначеЕсли НЕ ДанныеПоСтатусу[0].Статус = СтатусДокумента Тогда
	    СформируемЗаписьПоРегиструСтатусы(Отказ);
	КонецЕсли;
	
КонецПроцедуры

Процедура СформируемЗаписьПоРегиструСтатусы(Отказ)

	мДатаЗаписи = ТекущаяДата();
	
	НаборЗаписей = РегистрыСведений.АП_СтатусыДокументов.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Документ.Установить(Ссылка);
	НаборЗаписей.Отбор.Период.Установить(мДатаЗаписи);
	
	НаборЗаписей.Прочитать();
	
	НоваяСтрока = НаборЗаписей.Добавить();
	НоваяСтрока.Период = мДатаЗаписи;
	НоваяСтрока.Документ = Ссылка;
	НоваяСтрока.Статус = СтатусДокумента;
	НоваяСтрока.Ответственный = глЗначениеПеременной("глТекущийПользователь");
	
	Попытка		
		НаборЗаписей.Записать();		
	Исключение
		ОбщегоНазначения.СообщитьОбОшибке(ОписаниеОшибки(), Отказ);
	КонецПопытки;
	
КонецПроцедуры
